Revit 2026 API

# TransformCreateReflection Method

---

Creates a transform that represents a reflection across the given plane.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static Transform CreateReflection(
	Plane plane
)
```
```vb
Public Shared Function CreateReflection (
	plane As Plane
) As Transform
```
```cpp
public:
static Transform^ CreateReflection(
	Plane^ plane
)
```
```fsharp
static member CreateReflection :
        plane : Plane -> Transform
```

#### Parameters

plane Plane
     The plane.

#### Return Value

Transform The new transform.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was NULL |

#### Reference

Transform Class

Autodesk.Revit.DB Namespace